{
    "HOME": {
        "GREETING": "Hi, i'm Bruno Pons ",
        "PROFESSION": {
            "1": "I'm",
            "2": "Full-Stack",
            "3": "Developer."
        },
        "DESCRIPTION": "I specialize in providing comprehensive and effective full-stack solutions. deep understanding of front-end frameworks, skilled in back-end development, and focus on achieving seamless integration.",
        "CAREER": "My career",
        "PROJECTS": "My projects"
    },
    "ABOUT": {
        "TITLE":{
            "1": "驴Qui茅n ",
            "2": "soy",
            "3": "?"
        },
        "CONTENT": [
                "I am a passionate web developer with over 2 years of experience and a dedicated student at the Faculty of Engineering in Uruguay . I enjoy building web applications using a wide range of technologies, always striving to create excellent and clean solutions for challenging problems .",
                "In my free time, you'll find me honing my skills on HackerRank, diving into tech articles, and enjoying a good game of chess 锔. "
        ],
        "STACK": {
            "TITLE": {
                "1": "Tech",
                "2": "Stack"
            }
        }
    },
    "EXPERIENCE": {
        "TITLE":{
            "1": "My ",
            "2": "Career"
        },
        "ITEMS": [
            {
                "DATE": "2023, Jan - Present",
                "TITLE": "Montevideo COMM",
                "CONTENT": [
                    "As a software developer at Montevideo COMM, I have played a key role in designing and maintaining innovative technological solutions. My expertise is primarily focused on front-end development, using HTML, CSS, and JavaScript, along with GeneXus for back-end implementation.",
                    "Throughout my career, I have been involved in a wide range of projects, contributing to the development of custom applications for clients, as well as internal company projects such as Montevideo Portal."
                ],
                "IMAGE_SRC":"/montevideo-comm.webp"
            },
            {
                "DATE": "2021 - Present",
                "TITLE": "University | Self projects",
                "CONTENT": [
                    "During my time at UDELAR, I have been immersed in the Computer Engineering program, where I have acquired a solid foundation of knowledge in technology and web development.", 
                    "However, my learning didn't stop in the classrooms. I have dedicated time outside of the curriculum to delve into web application development, exploring various technologies both in the front-end and back-end. This personal initiative has allowed me to expand my skills beyond what is taught in class and develop a comprehensive understanding of web programming.",
                    "Through personal projects and self-directed experimentation, I have strengthened my ability to tackle technical challenges and find innovative solutions."
                ],
                "IMAGE_SRC":"/fing.webp"
            }
        ]
    },
    "EDUCATION": {
      "TITLE":{
            "1": "Mi ",
            "2": "Educaci贸n"
        },
        "CONTENT": [
            "Estoy finalizando la carrera de Ingenier铆a en Computaci贸n en la Universidad de la Rep煤blica, donde previamente obtuve el t铆tulo intermedio de Analista en Computaci贸n. Mi formaci贸n acad茅mica me ha brindado una base s贸lida en programaci贸n, algoritmos, estructuras de datos, bases de datos e ingenier铆a de software.",
            "Complemento estos conocimientos con experiencia pr谩ctica en desarrollo de aplicaciones web y la exploraci贸n de tecnolog铆as modernas, incluyendo soluciones basadas en inteligencia artificial. Esta combinaci贸n entre formaci贸n acad茅mica, proyectos personales y experiencia profesional me ha permitido desarrollar una visi贸n integral para construir soluciones tecnol贸gicas eficientes, escalables y orientadas a resolver problemas reales."
        ],
        "ITEMS": [
            {
                "DATE": "2021 - Presente",
                "TITLE": "Universidad | Proyectos personales",
                "CONTENT": [
                    "Durante mi tiempo en la UDELAR, he estado inmerso en la carrera de Ingenier铆a en Computaci贸n, donde he adquirido una base s贸lida de conocimientos en tecnolog铆a y desarrollo web.",
                    "Sin embargo, mi aprendizaje no se detuvo en las aulas. He dedicado tiempo fuera del plan de estudios para profundizar en la creaci贸n de aplicaciones web, explorando diversas tecnolog铆as tanto en el front-end como en el back-end. Esta iniciativa personal me ha permitido expandir mis habilidades m谩s all谩 de lo ense帽ado en clase y desarrollar una comprensi贸n integral de la programaci贸n web.", 
                    "A trav茅s de proyectos personales y experimentaci贸n autodidacta, he fortalecido mi capacidad para enfrentar desaf铆os t茅cnicos y encontrar soluciones innovadoras."
                ],
                "IMAGE_SRC":"/fing.webp"
            }
        ]  
    },
    "PROJECTS": {
        "TITLE":{
            "1": "Some of my ",
            "2": "Projects"
        },
        "ITEMS": [
            {
                "TITLE": "Spotify Clone",
                "CONTENT": "A simplified clone of the Spotify application, created with TypeScript + React + Express.",
                "IMAGE_URL": "/spotifyClone.webp",
                "GITHUB_URL": "https://github.com/bruaguspons/spotify-clone-react",
                "APP_URL": "",
                "COMMING_SOON": false
            },
            {
                "TITLE": "Space Invader",
                "CONTENT": "Recreated from the classic arcade game Space Invaders, entirely made with TypeScript.",
                "IMAGE_URL": "/spaceInvaders.webp",
                "GITHUB_URL": "https://github.com/bruaguspons/SpaceInvaders",
                "APP_URL": "https://bruaguspons.github.io/SpaceInvaders/",
                "COMMING_SOON": false
            },
            {
                "TITLE": "Chess + AI",
                "CONTENT": "The usual chess game, but the computer's moves are made with artificial intelligence.",
                "IMAGE_URL": "/knight.svg",
                "GITHUB_URL": "",
                "APP_URL": "",
                "COMMING_SOON": true
            }
        ],
        "COMMING_SOON_TEXT": "Comming soon ...",
        "GITHUB_MORE_INFO": "For more information, check the code by clicking on the icon below:",
        "APP_MORE_INFO": "By clicking on the button below, you can test the application:",
        "APP_BUTTON_TEXT": "Try it out!"
    },
    "CONTACT": {
        "TITLE":{
            "1": "Contact"
        },
        "FIELDS":[
            {
                "ID": "name",
                "LABEL": "Name",
                "AUTOCOMPLETE": "given-name",
                "TYPE": null,
                "REQUIRED": false,
                "ERRORS": {
                }
            },
            {
                "ID": "lastName",
                "LABEL": "Last Name",
                "AUTOCOMPLETE": "family-name",
                "TYPE": null,
                "REQUIRED": false,
                "ERRORS": {
                }
            },
             {
                "ID": "email",
                "LABEL": "Email",
                "AUTOCOMPLETE": "email",
                "TYPE": "email",
                "REQUIRED": true,
                "ERRORS": {
                    "empty": "The Email field must not be empty.",
                    "format": "The Email format is incorrect."
                }
            },
             {
                "ID": "message",
                "LABEL": "Message",
                "AUTOCOMPLETE": "",
                "TYPE": "textarea",
                "REQUIRED": true,
                "ERRORS": {
                    "empty": "The Message field must not be empty."
                }
            }
        ],
        "SUBMIT_ERROR": "An error has occurred. Please try again later.",
        "SUBMIT_SUCCESS": "Your email has been sent successfully! I'll get back to you as soon as possible. Thanks for reaching out!",
        "SEND_TEXT": "Send"
    },
    "SETTINGS":{
        "THEME_SWITCH":"Change Theme:",
        "LANGUAGE_SWITCH":"Change Language:"
    }
}