{
    "HOME": {
        "GREETING": "Hola, soy Bruno Pons 游녦",
        "PROFESSION": {
            "1": "Soy un",
            "2": "Full-Stack",
            "3": "Developer."
        },
        "DESCRIPTION": "Me especializo en proporcionar soluciones integrales y efectivas full-stack. Gran dominio de los frameworks de front-end, h치bil en desarrollo de back-end y me enfoco en lograr una integraci칩n fluida.",
        "CAREER": "Mi carrera",
        "PROJECTS": "Mis proyectos"
    },
    "ABOUT": {
        "TITLE":{
            "1": "Acerca",
            "2": " de mi"
        },
        "CONTENT": {
            "1": "Soy un apasionado desarrollador web con m치s de 2 a침os de experiencia y un dedicado estudiante de la facultad de ingenieria de Uruguay 游깷. Disfruto construyendo aplicaciones web utilizando una gran variedad de tecnolog칤as, siempre esforz치ndome por crear soluciones excelentes y limpias para problemas desafiantes 游눹.",
            "2": "En mi tiempo libre, me encontrar치s perfeccionando mis habilidades en HackerRank, sumergi칠ndome en art칤culos tecnol칩gicos y disfrutando de una buena partida de ajedrez 鮫勇. "
        } 
    },
    "CAREER": {
        "TITLE":{
            "1": "My ",
            "2": "Career"
        },
        "ITEMS": {
            "1": {
                "DATE": "2023, Ene - Presente",
                "TITLE": "Montevideo COMM",
                "CONTENT": "Como desarrollador de software en Montevideo COMM, he desempe침ado un papel integral en la creaci칩n y mantenimiento de soluciones tecnol칩gicas. Mi enfoque principal ha sido el desarrollo front-end utilizando HTML, CSS y JavaScript, junto con el uso de GeneXus para el back-end. A trav칠s de mi experiencia y habilidades t칠cnicas, he contribuido en grandes proyectos, tales como el portal de noticias Montevideo Portal. Adem치s, he contribuido en aplicaciones personalizadas para clientes destacados como la Universidad Cat칩lica del Uruguay (UCU) y Rep칰blica AFAP (RAFAP), satisfaciendo sus necesidades espec칤ficas con soluciones a medida.",
                "LINK": "/en/career/montevideo-comm"
            },
            "2": {
                "DATE": "2021 - Presente",
                "TITLE": "Universidad | Proyectos personales",
                "CONTENT": "Durante mi tiempo en la UDELAR, he estado inmerso en la carrera de Ingenier칤a en Computaci칩n, donde he adquirido una base s칩lida de conocimientos en tecnolog칤a y desarrollo web. Sin embargo, mi aprendizaje no se detuvo en las aulas. He dedicado tiempo fuera del plan de estudios para profundizar en la creaci칩n de aplicaciones web, explorando diversas tecnolog칤as tanto en el front-end como en el back-end. Esta iniciativa personal me ha permitido expandir mis habilidades m치s all치 de lo ense침ado en clase y desarrollar una comprensi칩n integral de la programaci칩n web. A trav칠s de proyectos personales y experimentaci칩n autodidacta, he fortalecido mi capacidad para enfrentar desaf칤os t칠cnicos y encontrar soluciones innovadoras.",
                "LINK": "/en/career/university-projects"
            }
        }
    },
    "PROJECTS": {
        "TITLE":{
            "1": "Algunos de mis ",
            "2": "Proyectos"
        },
        "CONTENT": "I'm a passionate web developer with over 2 years of experience and a dedicated computer science student hailing from Uruguay 游깷. I enjoy building web applications using a variety of technologies, always striving to create great and clean solutions for challenging problems 游눹. I have a penchant for independent learning and thrive on tackling complex issues. In my free time, you'll find me honing my skills on HackerRank, diving into tech articles, and relishing a good game of chess 鮫勇. Let's code and conquer together!"
    },
    "CONTACT": {
        "TITLE":{
            "1": "Contact",
            "2": "me"
        },
        "NAME":{
            "ID": "name",
            "LABEL": "Name",
            "AUTOCOMPLETE": "given-name",
            "TYPE": null,
            "REQUIRED": false,
            "ERRORS": {
            }
        },
        "LASTNAME":{
            "ID": "lastName",
            "LABEL": "Last Name",
            "AUTOCOMPLETE": "family-name",
            "TYPE": null,
            "REQUIRED": false,
            "ERRORS": {
            }
        },
        "EMAIL": {
            "ID": "email",
            "LABEL": "Email",
            "AUTOCOMPLETE": "email",
            "TYPE": "email",
            "REQUIRED": true,
            "ERRORS": {
                "empty": "Email field must not be empty.",
                "format": "Email format is not correct."
            }
        },
        "MESSAGE": {
            "ID": "message",
            "LABEL": "Message",
            "AUTOCOMPLETE": "",
            "TYPE": "textarea",
            "REQUIRED": true,
            "ERRORS": {
                "empty": "Message field must not be empty."
            }
        },
        "SUBMITERROR": "Error al hacer submit",
        "FIELDSERROR": "Errores en los inputs"
    }
}