{
    "HOME": {
        "GREETING": "Hola, soy Bruno Pons 👋",
        "PROFESSION": {
            "1": "Soy un",
            "2": "Full-Stack",
            "3": "Developer."
        },
        "DESCRIPTION": "Me especializo en proporcionar soluciones integrales y efectivas full-stack. Gran dominio de los frameworks de front-end, hábil en desarrollo de back-end y me enfoco en lograr una integración fluida.",
        "CAREER": "Mi carrera",
        "PROJECTS": "Mis proyectos"
    },
    "ABOUT": {
        "TITLE":{
            "1": "¿Quién ",
            "2": "soy",
            "3": "?"
        },
        "CONTENT": [ 
            "Desarrollador de software con más de dos años de experiencia en el desarrollo de aplicaciones web y estudiante de la Universidad de la República en Uruguay. Me especializo principalmente en desarrollo web, creando soluciones modernas y eficientes utilizando distintas tecnologías tanto en front-end como en back-end.",
            "A lo largo de mi experiencia profesional he trabajado en el desarrollo de productos digitales, así como en la integración de soluciones basadas en inteligencia artificial para crear nuevas funcionalidades, automatizar procesos y mejorar la experiencia de usuario en distintas plataformas.",
            "Me interesa especialmente construir software limpio, escalable y bien diseñado, enfrentando problemas desafiantes y explorando constantemente nuevas herramientas y tecnologías.",
            "Fuera del trabajo y el estudio, disfruto seguir aprendiendo y perfeccionando mis habilidades resolviendo problemas de programación en plataformas como HackerRank, leyendo sobre tecnología y jugando al Ajedrez."
        ],
        "STACK": {
            "TITLE": {
                "1": "Tech",
                "2": "Stack"
            }
        }
    },
    "EXPERIENCE": {
        "TITLE":{
            "1": "Experiencia ",
            "2": "Laboral"
        },
        "ITEMS": [
            {
                "DATE": "2023, Ene - Presente",
                "TITLE": "Montevideo COMM",
                "CONTENT": [
                    "Formo parte del equipo de desarrollo de Montevideo COMM, donde participo en el diseño, desarrollo y mantenimiento de soluciones tecnológicas para distintos productos digitales. Mi trabajo se centra principalmente en el desarrollo front-end utilizando HTML, CSS y JavaScript, junto con la implementación de lógica de negocio y servicios mediante GeneXus en el back-end.",
                    "He colaborado en el desarrollo de aplicaciones personalizadas para clientes y en proyectos internos de la empresa, incluyendo plataformas de alto tráfico como Montevideo Portal. Mi rol implica trabajar en la mejora continua de funcionalidades, optimización de interfaces y mantenimiento de sistemas en producción, contribuyendo a la estabilidad y evolución de los productos digitales de la organización.",
                    "Además, he participado en numerosos proyectos que integran inteligencia artificial, diseñando y desarrollando funcionalidades basadas en IA para automatizar procesos, mejorar la experiencia de usuario y potenciar las capacidades de distintas plataformas digitales."
                ],
                "IMAGE_SRC":"/montevideo-comm.webp"
            }
        ]
    },
    "EDUCATION": {
      "TITLE":{
            "1": "Mi ",
            "2": "Educación"
        },
        "CONTENT": [
            "Estoy finalizando la carrera de Ingeniería en Computación en la Universidad de la República, donde previamente obtuve el título intermedio de Analista en Computación. Mi formación académica me ha brindado una base sólida en programación, algoritmos, estructuras de datos, bases de datos e ingeniería de software.",
            "Complemento estos conocimientos con experiencia práctica en desarrollo de aplicaciones web y la exploración de tecnologías modernas, incluyendo soluciones basadas en inteligencia artificial. Esta combinación entre formación académica, proyectos personales y experiencia profesional me ha permitido desarrollar una visión integral para construir soluciones tecnológicas eficientes, escalables y orientadas a resolver problemas reales."
        ],
        "ITEMS": [
            {
                "DATE": "Mar 2021 - Ene 2026",
                "TITLE": "Analista en Computación — Universidad de la República",
                "CONTENT": [
                    "Título universitario intermedio de la carrera Ingeniería en Computación. Formación sólida en programación, algoritmos, estructuras de datos, bases de datos y fundamentos de ingeniería de software. Durante esta etapa desarrollé múltiples proyectos académicos y personales que me permitieron fortalecer mis habilidades en desarrollo web y resolución de problemas complejos."
                ]
            },
            {
                "DATE": "Mar 2021 - Dic 2026",
                "TITLE": "Ingeniería en Computación — Universidad de la República",
                "CONTENT": [
                    "Título de grado a recibirse en 2026. Formación integral en ciencias de la computación, arquitectura de software y desarrollo de sistemas. A lo largo de la carrera he complementado los conocimientos académicos con aprendizaje autodidacta y proyectos personales, explorando tecnologías modernas de desarrollo web y soluciones basadas en inteligencia artificial."
                ]
            }
        ]
    },
    "PROJECTS": {
        "TITLE":{
            "1": "Mis ",
            "2": "Proyectos"
        },
        "ITEMS": [
            {
                "TITLE": "Spotify Clone",
                "CONTENT": "Un clon simplificado de la aplicacion de Spotify, creado con TypeScript + React + Express",
                "IMAGE_URL": "/spotifyClone.webp",
                "GITHUB_URL": "https://github.com/bruaguspons/spotify-clone-react",
                "APP_URL": "",
                "COMMING_SOON": false
            },
            {
                "TITLE": "Space Invader",
                "CONTENT": "Recreado a partir del clásico juego de arcade Space Invaders, hecho enteramente con TypeScript.",
                "IMAGE_URL": "/spaceInvaders.webp",
                "GITHUB_URL": "https://github.com/bruaguspons/SpaceInvaders",
                "APP_URL": "https://bruaguspons.github.io/SpaceInvaders/",
                "COMMING_SOON": false
            },
            {
                "TITLE": "Chess + AI",
                "CONTENT": "El juego de ajedrez habitual, pero los movimientos de la computadora se realizan con inteligencia artificial.",
                "IMAGE_URL": "/knight.svg",
                "GITHUB_URL": "",
                "APP_URL": "",
                "COMMING_SOON": true
            }
        ],
        "COMMING_SOON_TEXT": "Próximamente ...",
        "GITHUB_MORE_INFO": "Para más información, checkea el código haciendo click en la imagen de abajo:",
        "APP_MORE_INFO": "Haciendo click en el botón de abajo, puedes probar la aplicación:",
        "APP_BUTTON_TEXT": "Pruébala!"
    },
    "CONTACT": {
        "TITLE":{
            "1": "Contáctame"
        },
        "FIELDS":[
            {
                "ID": "name",
                "LABEL": "Nombre",
                "AUTOCOMPLETE": "given-name",
                "TYPE": null,
                "REQUIRED": false,
                "ERRORS": {
                }
            },
            {
                "ID": "lastName",
                "LABEL": "Apellido",
                "AUTOCOMPLETE": "family-name",
                "TYPE": null,
                "REQUIRED": false,
                "ERRORS": {
                }
            },
             {
                "ID": "email",
                "LABEL": "Email",
                "AUTOCOMPLETE": "email",
                "TYPE": "email",
                "REQUIRED": true,
                "ERRORS": {
                    "empty": "El campo Email no debe estar vacío.",
                    "format": "El formato del Email no es correcto."
                }
            },
             {
                "ID": "message",
                "LABEL": "Mensaje",
                "AUTOCOMPLETE": "",
                "TYPE": "textarea",
                "REQUIRED": true,
                "ERRORS": {
                    "empty": "El campo Mensaje no debe estar vacío."
                }
            }
        ],
        "SUBMIT_ERROR": "Ha ocurrido un error. Por favor, inténtalo de nuevo más tarde.",
        "SUBMIT_SUCCESS": "¡Tu correo se ha enviado correctamente! Te responderé lo antes posible. ¡Gracias por ponerte en contacto!",
        "SEND_TEXT": "Enviar"
    },
    "SETTINGS":{
        "THEME_SWITCH":"Cambia el tema:",
        "LANGUAGE_SWITCH":"Cambia el lenguaje:"
    }
}