{
    "HOME": {
        "GREETING": "Hola, soy Bruno Pons 游녦",
        "PROFESSION": {
            "1": "Soy un",
            "2": "Full-Stack",
            "3": "Developer."
        },
        "DESCRIPTION": "Me especializo en proporcionar soluciones integrales y efectivas full-stack. Gran dominio de los frameworks de front-end, h치bil en desarrollo de back-end y me enfoco en lograr una integraci칩n fluida.",
        "CAREER": "Mi carrera",
        "PROJECTS": "Mis proyectos"
    },
    "ABOUT": {
        "TITLE":{
            "1": "Acerca",
            "2": " de mi"
        },
        "CONTENT": [ 
            "Soy un apasionado desarrollador web con m치s de 2 a침os de experiencia y un dedicado estudiante de la facultad de ingenieria de Uruguay 游깷. Disfruto construyendo aplicaciones web utilizando una gran variedad de tecnolog칤as, siempre esforz치ndome por crear soluciones excelentes y limpias para problemas desafiantes 游눹.",
            "En mi tiempo libre, me encontrar치s perfeccionando mis habilidades en HackerRank, sumergi칠ndome en art칤culos tecnol칩gicos y disfrutando de una buena partida de ajedrez 鮫勇. "
        ],
        "STACK": {
            "TITLE": {
                "1": "Tech",
                "2": "Stack"
            }
        }
    },
    "CAREER": {
        "TITLE":{
            "1": "Mi ",
            "2": "Carrera"
        },
        "ITEMS": [
            {
                "DATE": "2023, Ene - Presente",
                "TITLE": "Montevideo COMM",
                "CONTENT": [
                    "Como profesional en desarrollo de software en Montevideo COMM, he desempe침ado un papel esencial en la creaci칩n y mantenimiento de soluciones tecnol칩gicas. Me he enfocado principalmente en el desarrollo front-end utilizando HTML, CSS y JavaScript, complementado con la utilizaci칩n de GeneXus para el back-end.",
                    "A lo largo de mi trayectoria, he contribuido en grandes proyectos, como el prestigioso portal de noticias Montevideo Portal. Adem치s, he colaborado en la creaci칩n de aplicaciones personalizadas para clientes destacados, satisfaciendo sus requerimientos espec칤ficos con soluciones a la medida.",
                    "Una de mis contribuciones m치s destacadas al portal de noticias fue la integraci칩n de inteligencia artificial para optimizar el trabajo de los periodistas, especialmente en la generaci칩n de titulares. Dise침amos un sistema de sugerencias de t칤tulos basado en IA que agiliz칩 considerablemente el proceso de creaci칩n de encabezados al generar propuestas acordes al contenido de la noticia."

                ],
                "IMAGE_SRC":"/montevideo-comm.webp",
                "LINK": "/career/montevideo-comm",
                "SLUG": "montevideo-comm"
            },
            {
                "DATE": "2021 - Presente",
                "TITLE": "Universidad | Proyectos personales",
                "CONTENT": [
                    "Durante mi tiempo en la UDELAR, he estado inmerso en la carrera de Ingenier칤a en Computaci칩n, donde he adquirido una base s칩lida de conocimientos en tecnolog칤a y desarrollo web.",
                    "Sin embargo, mi aprendizaje no se detuvo en las aulas. He dedicado tiempo fuera del plan de estudios para profundizar en la creaci칩n de aplicaciones web, explorando diversas tecnolog칤as tanto en el front-end como en el back-end. Esta iniciativa personal me ha permitido expandir mis habilidades m치s all치 de lo ense침ado en clase y desarrollar una comprensi칩n integral de la programaci칩n web.", 
                    "A trav칠s de proyectos personales y experimentaci칩n autodidacta, he fortalecido mi capacidad para enfrentar desaf칤os t칠cnicos y encontrar soluciones innovadoras."
                ],
                "IMAGE_SRC":"/fing.webp",
                "LINK": "/career/university-projects",
                "SLUG": "university-projects"
            }
        ]
    },
    "PROJECTS": {
        "TITLE":{
            "1": "Algunos de mis ",
            "2": "Proyectos"
        },
        "ITEMS": [
            {
                "TITLE": "Spotify Clone",
                "CONTENT": "Un clon simplificado de la aplicacion de Spotify, creado con TypeScript + React + Express",
                "IMAGE_URL": "/spotifyClone.webp",
                "GITHUB_URL": "https://github.com/bruaguspons/spotify-clone-react",
                "APP_URL": "",
                "COMMING_SOON": false
            },
            {
                "TITLE": "Space Invader",
                "CONTENT": "Recreado a partir del cl치sico juego de arcade Space Invaders, hecho enteramente con TypeScript.",
                "IMAGE_URL": "/spaceInvaders.webp",
                "GITHUB_URL": "https://github.com/bruaguspons/SpaceInvaders",
                "APP_URL": "https://bruaguspons.github.io/SpaceInvaders/",
                "COMMING_SOON": false
            },
            {
                "TITLE": "Chess + AI",
                "CONTENT": "El juego de ajedrez habitual, pero los movimientos de la computadora se realizan con inteligencia artificial.",
                "IMAGE_URL": "/knight.svg",
                "GITHUB_URL": "",
                "APP_URL": "",
                "COMMING_SOON": true
            }
        ],
        "COMMING_SOON_TEXT": "Pr칩ximamente ...",
        "GITHUB_MORE_INFO": "Para m치s informaci칩n, checkea el c칩digo haciendo click en la imagen de abajo:",
        "APP_MORE_INFO": "Haciendo click en el bot칩n de abajo, puedes probar la aplicaci칩n:",
        "APP_BUTTON_TEXT": "Pru칠bala!"
    },
    "CONTACT": {
        "TITLE":{
            "1": "Contacta",
            "2": "me"
        },
        "FIELDS":[
            {
                "ID": "name",
                "LABEL": "Nombre",
                "AUTOCOMPLETE": "given-name",
                "TYPE": null,
                "REQUIRED": false,
                "ERRORS": {
                }
            },
            {
                "ID": "lastName",
                "LABEL": "Apellido",
                "AUTOCOMPLETE": "family-name",
                "TYPE": null,
                "REQUIRED": false,
                "ERRORS": {
                }
            },
             {
                "ID": "email",
                "LABEL": "Email",
                "AUTOCOMPLETE": "email",
                "TYPE": "email",
                "REQUIRED": true,
                "ERRORS": {
                    "empty": "El campo Email no debe estar vac칤o.",
                    "format": "El formato del Email no es correcto."
                }
            },
             {
                "ID": "message",
                "LABEL": "Mensaje",
                "AUTOCOMPLETE": "",
                "TYPE": "textarea",
                "REQUIRED": true,
                "ERRORS": {
                    "empty": "El campo Mensaje no debe estar vac칤o."
                }
            }
        ],
        "SUBMIT_ERROR": "Ha ocurrido un error. Por favor, int칠ntalo de nuevo m치s tarde.",
        "SUBMIT_SUCCESS": "춰Tu correo se ha enviado correctamente! Te responder칠 lo antes posible. 춰Gracias por ponerte en contacto!",
        "SEND_TEXT": "Enviar"
    },
    "SETTINGS":{
        "THEME_SWITCH":"Cambia el tema:",
        "LANGUAGE_SWITCH":"Cambia el lenguaje:"
    }
}